Revit 2027 API
BuiltInFailures.RoomFailures.OptionConflictInLinkRoomOverlapOption Property
 Option conflict between rooms in the Revit link '[Link Instance Name]'.\nA room in the Revit link's option '[Option #1 Name in Link]' overlaps a room in the Revit link's option '[Option #2 Name in Link]'.\nTo resolve the issue, open the Revit link file for editing, and delete the duplicate room or use room separation lines to divide the space in the main model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OptionConflictInLinkRoomOverlapOption { get; }
Public Shared ReadOnly Property OptionConflictInLinkRoomOverlapOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OptionConflictInLinkRoomOverlapOption {
	FailureDefinitionId^ get ();
}
static member OptionConflictInLinkRoomOverlapOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace